# SteelElemBoltFinishCalculationAtGap Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemBoltFinishCalculationAtGap Property
ParameterTypeId Class See Also
---
"Finish Calculation At Gap"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemBoltFinishCalculationAtGap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemBoltFinishCalculationAtGap As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemBoltFinishCalculationAtGap {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace